БухЭксп/Documents/CW_КорректировкаАктированияСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_КорректировкаАктированияСчетов</Name>
			<BasedOn>
				<xr:Item>Document.CW_ДоходыПоГрузоперевозке</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.CW_АктированиеИсходящихСчетов</xr:Item>
				<xr:Item>AccumulationRegister.CW_АктированиеВходящихСчетов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КорректировкаАктирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВходящийСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИсходящийСчет</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДвижения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокОтражения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_АктированиеВходящихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_АктированиеВходящихСчетов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_АктированиеИсходящихСчетов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_АктированиеИсходящихСчетов</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядокОтражения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ПорядокОтраженияДоходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Номенклатура</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтавкаНДС</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяКредиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяКредиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоПриобретениям</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/AccumulationRegisters/CW_ОперативнаяДебиторскаяЗадолженность.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>CW_ОперативнаяДебиторскаяЗадолженность</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Всего_Валюта</Name>
					<Comment>"Всего" в валюте договора</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Всего</Name>
					<Comment>"Всего" в базовой валюте учета</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.CW_ВидыДвиженийПоОперативнойЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Организации</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_КорректировкаОперативнойЗадолженности</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДвижениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_Оплата</v8:Type>
						<v8:Type>cfg:DocumentRef.CW_РеализацияПрочихТоваровУслуг</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Валюты</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_Счет</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

БухЭксп/Documents/CW_КорректировкаАктированияСчетов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	CW_Документы.УстановитьПараметрыФункциональныхОпцийФормы(Этаформа);
	// ---------------------------------------------------------------------------- 
	ИспользованиеСхемыПеревыставленияПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
	
	ВедетсяУчетПриложенийПоДоговорам = ПолучитьФункциональнуюОпцию("CW_ВедетсяУчетПриложенийПоДоговорам");
	
	
	_ПраваДоступа();
	
	БазоваяВалюта = CW_Настройки.ВалютаРегламентированногоУчета();
	// --- 
	Если (Объект.Ссылка.Пустая()) Тогда
		Если (Объект.Организация.Пустая()) Тогда
			
			ОсновнаяОрганизация = CW_Настройки.ОсновнаяОрганизация();
			Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
				Объект.Организация = ОсновнаяОрганизация;	
			КонецЕсли;
			
		КонецЕсли;
	КонецЕсли; 
	// --- 
	
	Если ЗначениеЗаполнено(Объект.Договор) Тогда
		ПараметрыОпции = Новый Структура;
		ПараметрыОпции.Вставить("CW_ДоговорПоГрузоперевозкам", Объект.Договор);
		
		ВедетсяУчетПриложенийПоДоговору = ПолучитьФункциональнуюОпцию("CW_УчитыватьПриложенияВДокументах", ПараметрыОпции);
		
		Валюта = Объект.Договор.ВалютаДоговора;
		Если ВедетсяУчетПриложенийПоДоговорам и ВедетсяУчетПриложенийПоДоговору и ЗначениеЗаполнено(Объект.ПриложениеКДоговору) Тогда
			Валюта	= Объект.ПриложениеКДоговору.ВалютаДоговора;
		КонецЕсли;
	КонецЕсли;
	
	_ОбновитьПредставление_Списание();
	
	ОбновитьИтоги();
	
	_УФС.ОтключитьИсториюВыбораЭлементовФормы(ЭтаФорма);
	
	_УправлениеЭлементамиФормы();
	
	_СформироватьЗаголовок();
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
	Если ИспользованиеСхемыПеревыставленияПоСтавкам Тогда
		Элементы.КорректировкаПорядокОтражения.СписокВыбора.Добавить(Перечисления.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам);
	КонецЕсли;
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	//Подсистема.УчетПриложенийДоговоров	
	
	//Внешние подклчюаемые команды
	CW_ПодключаемыеКомандыСервер.ПриСозданииНаСервере(ЭтотОбъект);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовитьДанныеФормы();
	
КонецПроцедуры


&НаКлиенте
Процедура КорректировкаГрузоперевозкаПриИзменении(Элемент)
	ПодготовитьДанныеФормы();
КонецПроцедуры

&НаСервере
Процедура ПодготовитьДанныеФормы()
	
	ЗаполнитьДобавленныеКолонкиТаблиц("КорректировкаАктирования");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДобавленныеКолонкиТаблиц(ИмяТабличнойЧасти)
	
	МассивГрузоперевозок 	= Объект[ИмяТабличнойЧасти].Выгрузить().ВыгрузитьКолонку("Грузоперевозка");
	СвойстваГрузоперевозок 	= CW_Грузоперевозки_Сервер.ПолучитьСведенияПоГрузоперевозкам(МассивГрузоперевозок);

	Для каждого СтрокаДокумента Из Объект[ИмяТабличнойЧасти] Цикл

		СтруктураСвойств = СвойстваГрузоперевозок.Получить(СтрокаДокумента.Грузоперевозка);
		
		Если СтруктураСвойств <> Неопределено Тогда
			 СтруктураСвойств.Свойство("ПометкаУдаления",СтрокаДокумента.ГрузоперевозкаУдалена);
		Конецесли;
		
	КонецЦикла;
	
КонецПроцедуры



// ---------------------------------------------------------------------------- 

&НаСервере
Процедура _УправлениеЭлементамиФормы()
	// --- 
	
	Элементы.КорректировкаГруппаВходящийСчет.Видимость = (Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	Элементы.КорректировкаГруппаИсходящийСчет.Видимость = (Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	// --- 
	
	Элементы.СтраницаКомментарий.Заголовок = " Комментарий" +?(ЗначениеЗаполнено(Объект.Комментарий)," (*)","");
	
	// --- 
КонецПроцедуры

Функция _ПраваДоступа()
	// --- 
	
	ПравоРедактирования = CW_ПраваДоступа.ПравоДоступно("РедактированиеФинансов_ОперативныйУчет");
	Если (НЕ ПравоРедактирования ИЛИ ЭтаФорма.ТолькоПросмотр) Тогда
		
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	// --- 
КонецФункции


&НаСервере
Функция _СформироватьЗаголовок()
	
	//ЗаголовокДокумента = 
	//	"Корректировка оперативной задолженности" + " " 
	//	+ ?(ЗначениеЗаполнено(Объект.ВидОперации), "("+нрег(Объект.ВидОперации)+")", "")
	//	+ ?(ЗначениеЗаполнено(Объект.Ссылка), " "+Объект.Номер+" от "+Объект.Дата, " (создание)")
	//;
	//ЭтаФорма.Заголовок = ЗаголовокДокумента;
	
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ЗаполнитьКорректировку(Команда)
	
	Если (Объект.КорректировкаАктирования.Количество() <> 0) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаОчисткиКорректировки",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		ВыполнитьЗаполнениеКорректировки();
	
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаОчисткиКорректировки(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		ВыполнитьЗаполнениеКорректировки();
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаКлиенте
Процедура ВыполнитьЗаполнениеКорректировки()
	// --- 
	
	Ответ = _ЗаполнитьКорректировку();
	Если НЕ _УФКС.ВыполненоУспешно(Ответ) Тогда
		
		_УФК.ВывестиПредупреждение(_УФКС.ПредставлениеОшибки(Ответ));
		
	КонецЕсли; 
	ОбновитьИтоги();
	
	// --- 
КонецПроцедуры
  
 
&НаСервере
Функция _ЗаполнитьКорректировку()
	// --- 
	
	Если Объект.Договор.Пустая() Тогда
		
		Возврат(_УФКС.Ответ(1,"Не указан договор"));
		
	КонецЕсли; 
	
	Если Объект.Договор.ВидДоговора.Пустая() Тогда
		
		Возврат(_УФКС.Ответ(1,"Не указан вид договора"));
		
	КонецЕсли; 
	
	Если Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_АктированиеВходящихСчетовОстатки.Счет КАК ВходящийСчет,
		               |	CW_АктированиеВходящихСчетовОстатки.Организация,
		               |	CW_АктированиеВходящихСчетовОстатки.Контрагент,
		               |	CW_АктированиеВходящихСчетовОстатки.Договор,
		               |	CW_АктированиеВходящихСчетовОстатки.Грузоперевозка,
		               |	CW_АктированиеВходящихСчетовОстатки.ПорядокОтражения,
		               |	CW_АктированиеВходящихСчетовОстатки.Номенклатура,
		               |	CW_АктированиеВходящихСчетовОстатки.СтавкаНДС,
		               |	CW_АктированиеВходящихСчетовОстатки.СуммаОстаток КАК Сумма,
		               |	CW_АктированиеВходящихСчетовОстатки.НДСОстаток КАК НДС,
		               |	CW_АктированиеВходящихСчетовОстатки.ВсегоОстаток КАК Всего
		               |ИЗ
		               |	РегистрНакопления.CW_АктированиеВходящихСчетов.Остатки(
		               |			&Период,
		               |			Организация = &Организация
		               |				И Контрагент = &Контрагент
		               |				И Договор = &Договор
					   //Подсистема.УчетПриложенийДоговоров
		               |				И ПриложениеКДоговору = &ПриложениеКДоговору
					   //Подсистема.УчетПриложенийДоговоров
		               |				И Валюта = &Валюта) КАК CW_АктированиеВходящихСчетовОстатки";
		
	ИначеЕсли Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_АктированиеИсходящихСчетовОстатки.Счет КАК ИсходящийСчет,
		               |	CW_АктированиеИсходящихСчетовОстатки.Организация,
		               |	CW_АктированиеИсходящихСчетовОстатки.Контрагент,
		               |	CW_АктированиеИсходящихСчетовОстатки.Договор,
		               |	CW_АктированиеИсходящихСчетовОстатки.Грузоперевозка,
		               |	CW_АктированиеИсходящихСчетовОстатки.ПорядокОтражения,
		               |	CW_АктированиеИсходящихСчетовОстатки.Номенклатура,
		               |	CW_АктированиеИсходящихСчетовОстатки.СтавкаНДС,
		               |	CW_АктированиеИсходящихСчетовОстатки.ВсегоОстаток КАК Всего,
		               |	CW_АктированиеИсходящихСчетовОстатки.НДСОстаток КАК НДС,
		               |	CW_АктированиеИсходящихСчетовОстатки.СуммаОстаток КАК Сумма
		               |ИЗ
		               |	РегистрНакопления.CW_АктированиеИсходящихСчетов.Остатки(
		               |			&Период,
		               |			Организация = &Организация
		               |				И Контрагент = &Контрагент
		               |				И Договор = &Договор
					   //Подсистема.УчетПриложенийДоговоров
		               |				И ПриложениеКДоговору = &ПриложениеКДоговору
					   //Подсистема.УчетПриложенийДоговоров
		               |				И Валюта = &Валюта) КАК CW_АктированиеИсходящихСчетовОстатки";
		
	Иначе
		
		Возврат(_УФКС.Ответ(1,"Некорректный вид договора."));
		
	КонецЕсли; 
	// --- 
	
	_сф.ст_ДобавитьСвойства(Запрос.Параметры,"Организация,Контрагент,Договор,Валюта:Договор.ВалютаДоговора",Объект);
	Запрос.УстановитьПараметр("Период", Новый Граница(Объект.Дата,ВидГраницы.Исключая));
	
	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору", Объект.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	// --- 
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если _сф.Количество(ТЗ) = 0 Тогда
		
		Возврат(_УФКС.Ответ(1,"Нет данных для заполнения."));
		
	Иначе
		
		Объект.КорректировкаАктирования.Загрузить(ТЗ);
		_ОбновитьПредставление_Списание();
		Возврат(_УФКС.Ответ());
		
	КонецЕсли; 
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаСервере
Функция _ОбновитьПредставление_Списание()
	// --- 
	
	//Для каждого Стр Из Объект.ВО_СписаниеОЗ Цикл
	//	
	//	Если (ТипЗнч(Стр.ДокументСчет)=Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
	//		Стр.Представление = Стр.ДокументСчет.ПредставлениеДокумента;
	//	ИначеЕсли (ТипЗнч(Стр.ДокументСчет)=Тип("ДокументСсылка.CW_РасходыПоГрузоперевозке")) Тогда
	//		Стр.Представление = Стр.ДокументСчет.ПредставлениеДокумента;
	//	ИначеЕсли (ТипЗнч(Стр.ДокументСчет)=Тип("ДокументСсылка.CW_Оплата")) Тогда 
	//		Стр.Представление = Стр.ДокументСчет.ПредставлениеДокумента;
	//	ИначеЕсли (ТипЗнч(Стр.ДокументСчет)=Тип("ДокументСсылка.CW_ДвижениеДенежныхСредств")) Тогда 
	//		Стр.Представление = Стр.ДокументСчет.ПредставлениеДокумента; 	
	//	Иначе
	//		Стр.Представление = "";
	//	КонецЕсли; 
	//	
	//КонецЦикла; 
	
	// --- 
КонецФункции


// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	
	_ДоговорПриИзменении();
	
КонецПроцедуры
 
&НаСервере
Функция _ДоговорПриИзменении()
	// --- 
	
	Валюта = Объект.Договор.ВалютаДоговора;
	// --- 
	_ОчиститьТЧ();
	
	_УправлениеЭлементамиФормы();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииДоговораНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
	
	// --- 
КонецФункции

&НаСервере
Процедура ПриложениеКДоговоруПриИзмененииНаСервере()
	
	Валюта = Объект.ПриложениеКДоговору.ВалютаДоговора;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриложениеКДоговоруПриИзменении(Элемент)
	
	ПриложениеКДоговоруПриИзмененииНаСервере();
	
КонецПроцедуры


&НаСервере
Функция _ОчиститьТЧ()
	// --- 
	
	Если (Объект.Договор.Организация <> Объект.Организация ИЛИ Объект.Договор.Владелец <> Объект.Контрагент) Тогда
		Объект.КорректировкаАктирования.Очистить();
		ОбновитьИтоги();
	КонецЕсли; 
	
	// --- 
КонецФункции
 

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	_КонтрагентПриИзменении();
	
КонецПроцедуры

&НаСервере
Функция _КонтрагентПриИзменении()
	// --- 
	
	Объект.ПриложениеКДоговору = Неопределено;
	
	_ОчиститьТЧ();
	
	_УправлениеЭлементамиФормы();
	
	//Подсистема.УчетПриложенийДоговоров
	CW_УчетПриложенийДоговоровСервер.ПриИзмененииКонтрагентаНаСервере(ЭтаФорма);
	//Подсистема.УчетПриложенийДоговоров
	
КонецФункции
 

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	
	_УправлениеЭлементамиФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьКорректировку(Команда)
	
	Объект.КорректировкаАктирования.Очистить();
	ОбновитьИтоги();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПриИзменении(Элемент)
	
	ОбновитьИтоги();
	
КонецПроцедуры
 
Процедура ОбновитьИтоги()
	
	// итоговая строка по табличной части "Услуги" 
	СВ = Строка(Объект.Договор.ВалютаДоговора);
	ФЧ = "ЧЦ=15; ЧДЦ=2; ЧН=";
	Элементы.СтраницаСписание.Заголовок = "Актирование ("+Строка(Объект.КорректировкаАктирования.Количество())+")";
	Если Объект.КорректировкаАктирования.Количество() = 0 Тогда
		ИтогоПоКорректировке = "Нет данных";
	Иначе
		ИтогоПоКорректировке =	"Сумма: "+Формат(Объект.КорректировкаАктирования.Итог("Сумма"),ФЧ)+" " +СВ
		+"; НДС: "+Формат(Объект.КорректировкаАктирования.Итог("НДС"),ФЧ)+" " +СВ
		+"; Всего: "+Формат(Объект.КорректировкаАктирования.Итог("Всего"),ФЧ)+" " +СВ;
	КонецЕсли;
						
КонецПроцедуры

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура КорректировкаВходящийСчетПриИзменении(Элемент)
	
	ОбработатьИзменениеСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаИсходящийСчетПриИзменении(Элемент)
	
	ОбработатьИзменениеСчета();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеСчета()
	// --- 
	
	_ОбработатьИзменениеСчета(Элементы.Корректировка.ТекущаяСтрока);
	
	// --- 
КонецПроцедуры

&НаСервере
Процедура _ОбработатьИзменениеСчета(ИдентификаторСтроки)
	// --- 
	
	СтрокаТЧ = Объект.КорректировкаАктирования.НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если (Объект.Договор.ВалютаДоговора <> БазоваяВалюта) Тогда
		
		// подставляем текущий курс
		Если (НЕ Объект.Договор.ВалютаДоговора.Пустая()) Тогда
			
			СК = CW_Финансы.ПолучитьКурсВалюты(Объект.Договор.ВалютаДоговора,Объект.Дата);
			СтрокаТЧ.Курс = СК.Курс;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// снимаем остатки по счету в разрезе счетов учета
	Если (Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком) Тогда
		
		Счет = СтрокаТЧ.ВходящийСчет;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Счет КАК Счет,
		               |	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		               |	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Сумма,
		               |	CW_ОперативнаяКредиторскаяЗадолженностьОстатки.ВсегоОстаток КАК Сумма_БВ
		               |ИЗ
		               |	РегистрНакопления.CW_ОперативнаяКредиторскаяЗадолженность.Остатки(
		               |			&Период,
		               |			Организация = &Организация
		               |				И Контрагент = &Контрагент
		               |				И Договор = &Договор
					   //Подсистема.УчетПриложенийДоговоров
		               |				И ПриложениеКДоговору = &ПриложениеКДоговору
					   //Подсистема.УчетПриложенийДоговоров
		               |				И Валюта = &Валюта
		               |				И Счет = &Счет) КАК CW_ОперативнаяКредиторскаяЗадолженностьОстатки";
		
	ИначеЕсли Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем Тогда
		
		Счет = СтрокаТЧ.ИсходящийСчет;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Счет КАК Счет,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.СчетУчета КАК СчетЗадолженности,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.Всего_ВалютаОстаток КАК Сумма,
		               |	CW_ОперативнаяДебиторскаяЗадолженностьОстатки.ВсегоОстаток КАК Сумма_БВ
		               |ИЗ
		               |	РегистрНакопления.CW_ОперативнаяДебиторскаяЗадолженность.Остатки(
		               |			&Период,
		               |			Организация = &Организация
		               |				И Контрагент = &Контрагент
		               |				И Договор = &Договор
					   //Подсистема.УчетПриложенийДоговоров
		               |				И ПриложениеКДоговору = &ПриложениеКДоговору
					   //Подсистема.УчетПриложенийДоговоров
		               |				И Валюта = &Валюта
					   |				И Счет = &Счет) КАК CW_ОперативнаяДебиторскаяЗадолженностьОстатки";
		
	КонецЕсли; 
	
	_сф.ст_ДобавитьСвойства(Запрос.Параметры,"Организация,Контрагент,Договор,Валюта",Объект);
	Запрос.УстановитьПараметр("Счет", Счет); 
	Запрос.УстановитьПараметр("Период", Новый Граница(Объект.Дата,ВидГраницы.Исключая));
	
	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору", Объект.ПриложениеКДоговору); 
	//Подсистема.УчетПриложенийДоговоров
	
	ТЗ = Запрос.Выполнить().Выгрузить();
	
	Если (ТЗ.Количество() <> 0) Тогда
		
		Если (ТЗ.Количество() =1) Тогда
			
			СтрокаЗапроса = ТЗ[0];
			СтрокаТЧ.СчетУчета = СтрокаЗапроса.СчетУчета;
			СтрокаТЧ.Сумма = СтрокаЗапроса.Сумма;
			
		Иначе
			
			СтрокаТЧ.СчетУчета = ТЗ[0].СчетУчета;
			
		КонецЕсли; 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаСчетЗадолженностиНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	//СписокСчетов = _СформироватьСписокВыбораДляСчетаУчета(Элементы.Корректировка.ТекущаяСтрока);
	//Элемент.СписокВыбора.Очистить();
	//Для каждого Стр Из СписокСчетов Цикл
	//	Элемент.СписокВыбора.Добавить(Стр.Значение);
	//КонецЦикла; 
	
КонецПроцедуры

&НаСервере
Функция _СформироватьСписокВыбораДляСчетаУчета(ИдентификаторСтроки)
	// --- 
	
	СтрокаТЧ = Объект.КорректировкаАктирования.НайтиПоИдентификатору(ИдентификаторСтроки);
	Счет = СтрокаТЧ.ДокументСчет;
	
	ТаблицаСчетовУчета =  Счет.Услуги.Выгрузить(,"СчетЗадолженности");
	ТаблицаСчетовУчета.Свернуть("СчетЗадолженности");
	СписокСчетов = Новый СписокЗначений;
	СписокСчетов.ЗагрузитьЗначения(ТаблицаСчетовУчета.ВыгрузитьКолонку("СчетЗадолженности"));
	Возврат(СписокСчетов);
	
	// --- 
КонецФункции




&НаСервере
Функция _ВидОперацииПриИзменении()
	// --- 
	
	ОбновитьИтоги();
	_УправлениеЭлементамиФормы();
	_СформироватьЗаголовок();
	
	// --- 
КонецФункции

// ---------------------------------------------------------------------------- 

&НаКлиенте
Процедура НомерПриИзменении(Элемент)
	
	_СформироватьЗаголовок();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	_СформироватьЗаголовок();
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	_СформироватьЗаголовок();
	
	ПодготовитьДанныеФормы();
	
	// --- 
	СостояниеДокумента = ОбщегоНазначенияБП.СостояниеДокумента(Объект); // ВызовБП
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
		
	_ОчиститьТЧ();
	
	Если (ЗначениеЗаполнено(Объект.Номер) И ЗначениеЗаполнено(Объект.Организация)) Тогда
		
		ПОВ = Новый ОписаниеОповещения("ОбработкаВопросаУстановкиНомера",ЭтотОбъект); 
		ПоказатьВопрос(ПОВ,"Установить новый номер документа", РежимДиалогаВопрос.ДаНет); 
		
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВопросаУстановкиНомера(Ответ, ДополнительныеПараметры) Экспорт 
	// --- 
	
	Если (Ответ=КодВозвратаДиалога.Да) Тогда
		_УстановитьНовыйНомер();
	КонецЕсли; 
	
	// --- 
КонецПроцедуры
  

&НаСервере
Функция _УстановитьНовыйНомер()
	// --- 
	
	ДО = РеквизитФормыВЗначение("Объект");
	ДО.УстановитьНовыйНомер();
	ЗначениеВРеквизитФормы(ДО,"Объект");
	
	// --- 
КонецФункции

&НаСервере
Функция _ГрузоперевозкиСчета(ИдентификторСтроки)
	// --- 
	
	СтрокаТЧ = Объект.КорректировкаАктирования.НайтиПоИдентификатору(ИдентификторСтроки);
	Если (Объект.Договор.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.СПокупателем) Тогда
		Счет = СтрокаТЧ.ИсходящийСчет;
	Иначе
		Счет = СтрокаТЧ.ВходящийСчет;
	КонецЕсли; 
	
	ГП = Счет.Услуги.Выгрузить(,"Грузоперевозка");
	ГП.Свернуть("Грузоперевозка");
	
	Возврат(ГП.ВыгрузитьКолонку("Грузоперевозка"));
	
	// --- 
КонецФункции

&НаКлиенте
Процедура КорректировкаГрузоперевозкаНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПриАктивизацииСтроки(Элемент)
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура КорректировкаПриАктивизацииЯчейки(Элемент)
	
	Если (Элемент.ТекущийЭлемент.Имя = "КорректировкаГрузоперевозка") Тогда
		
		Элемент.ТекущийЭлемент.СписокВыбора.Очистить();
		МассивГП = _ГрузоперевозкиСчета(Элементы.Корректировка.ТекущаяСтрока);
		Для каждого Стр Из МассивГП Цикл
			
			Элемент.ТекущийЭлемент.СписокВыбора.Добавить(Стр);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
КонецПроцедуры

	&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ВыполнитьМетодВладельца" Тогда
			
		Если ТипЗнч(Параметр) = тип("Структура") Тогда
			УникальныйИдентификаторВладельца 	= Неопределено;
			МетодыФормыВладельца 				= Неопределено;
			
			Параметр.Свойство("УникальныйИдентификатор"	, УникальныйИдентификаторВладельца);
			Параметр.Свойство("МетодыФормыВладельца"	, МетодыФормыВладельца);
			
			Если ЭтаФорма.УникальныйИдентификатор = УникальныйИдентификаторВладельца Тогда
				Если Не МетодыФормыВладельца = Неопределено и ТипЗнч(МетодыФормыВладельца) = Тип("Массив") Тогда
					
					Для Каждого СтрокаМассива из МетодыФормыВладельца Цикл
						Попытка
							Выполнить(СтрокаМассива);
						Исключение
						КонецПопытки;
					КонецЦикла;
					
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;	

	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
		
	//Подсистема.РаботаСПодключаемымиОбъектами
	CW_ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи);
	//Подсистема.РаботаСПодключаемымиОбъектами

КонецПроцедуры


#Область Подключаемые_внешние_команды

&НаКлиенте
Процедура ВнешняяКоманда_ВыполнитьКоманду(Команда)
	
	CW_ПодключаемыеКомандыКлиент.ВыполнитьВнешнююКоманду(ЭтотОбъект, Команда.Имя);
	
КонецПроцедуры


#КонецОбласти
